Revit 2015 API
FormatOptions.GetName Method
 Gets the string used in type catalogs to identify the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use UnitUtils.GetTypeCatalogString(DisplayUnitType) instead.")]
public string GetName()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use UnitUtils.GetTypeCatalogString(DisplayUnitType) instead.")> _
Public Function GetName As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use UnitUtils.GetTypeCatalogString(DisplayUnitType) instead.")]
public:
String^ GetName()
Return Value
 The type catalog string, or an empty string if the display unit cannot be used in type catalogs.
Remarks
 This method is equivalent to calling UnitUtils.GetTypeCatalogString(DisplayUnitType) with the display unit in this FormatOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace